backend/app/Service/admin/RerollCategoryService.php

    public function getAll()
    {
        $rerollCategory = RerollCategory::all();
---
SELECT * FROM `reroll_categories`

    public function getById($id) {
        return RerollCategory::where('id', $id)->first();
---
SELECT * FROM `reroll_categories` WHERE `id` = '9' LIMIT 1

    public function edit($id, $name, $image, $note, $status)
    {
        $rollCategory = RerollCategory::where('id', $id)->first();
        $rollCategory->$name;
        $rollCategory->$image;
        $rollCategory->$note;
        $rollCategory->$status;
        $rollCategory->save();
---
SELECT * FROM `reroll_categories` WHERE `id` = '7' LIMIT 1
UPDATE `reroll_categories` SET `note` = 'ttggg', `reroll_categories`.`updated_at` = '2024-09-25 15:41:15' WHERE `id` = 7

    public function delete($idRerollCategory) {
        RerollCategory::destroy($idRerollCategory);
---
DELETE FROM `reroll_categories` WHERE `id` = 5